# Packages
brew "btop"
brew "coreutils"
brew "curl"
brew "fastfetch"
brew "fzf"
brew "git"
brew "jemalloc"
brew "jq"
brew "libpq"
brew "libyaml"
brew "mise"
brew "ollama"
brew "overmind"
brew "pnpm"
brew "postgresql@17"
brew "uv"
brew "vips"
brew "wget"
brew "zsh"
brew "redis"
brew "yarn"

# Cask applications
cask "1password"
cask "brave-browser"
cask "cursor"
cask "discord"
cask "docker"
cask "ghostty"
cask "netnewswire"
cask "obsidian"
cask "orbstack"
cask "pearcleaner"
cask "raycast"
cask "rectangle"
cask "vlc"
cask "whatsapp"
cask "zoom"
cask "claude"

# Fonts
cask "font-cascadia-code"
cask "font-cascadia-mono"
cask "font-dm-sans"
cask "font-fira-code"
cask "font-hack"
cask "font-ibm-plex-mono"
cask "font-ibm-plex-sans"
cask "font-3270-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-inconsolata-go-nerd-font"
cask "font-inconsolata-lgc-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-monofur-nerd-font"
cask "font-overpass-nerd-font"
cask "font-ubuntu-mono-nerd-font"
cask "font-agave-nerd-font"
cask "font-arimo-nerd-font"
cask "font-anonymice-nerd-font"
cask "font-aurulent-sans-mono-nerd-font"
cask "font-bigblue-terminal-nerd-font"
cask "font-bitstream-vera-sans-mono-nerd-font"
cask "font-blex-mono-nerd-font"
cask "font-caskaydia-cove-nerd-font"
cask "font-code-new-roman-nerd-font"
cask "font-cousine-nerd-font"
cask "font-daddy-time-mono-nerd-font"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-droid-sans-mono-nerd-font"
cask "font-fantasque-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-go-mono-nerd-font"
cask "font-gohufont-nerd-font"
cask "font-hack-nerd-font"
cask "font-hasklug-nerd-font"
cask "font-heavy-data-nerd-font"
cask "font-hurmit-nerd-font"
cask "font-im-writing-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-lekton-nerd-font"
cask "font-liberation-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-monoid-nerd-font"
cask "font-mononoki-nerd-font"
cask "font-mplus-nerd-font"
cask "font-noto-nerd-font"
cask "font-open-dyslexic-nerd-font"
cask "font-profont-nerd-font"
cask "font-proggy-clean-tt-nerd-font"
cask "font-roboto-mono-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-shure-tech-mono-nerd-font"
cask "font-space-mono-nerd-font"
cask "font-terminess-ttf-nerd-font"
cask "font-tinos-nerd-font"
cask "font-ubuntu-nerd-font"
cask "font-victor-mono-nerd-font"
